
// Do not initialize inputs!
void Init(void)
{

}

void Exec(void)
{
  float jog, v_delt, v_err;
  jog = v->a_max / v->t_jog;
  v_delt = v->t_jog * v->a_cur;
  v_err = *v->V_ref - v->v_cur;
  v->V = v->v_cur;
  v->A = v->a_cur;
  if (!*v->rst)
  {
  // основной режим работы
    if (v_err >= 0)
    {
    // разгон ===============================================
      // равноускоренное движение --------------------------
      v->v_cur += v->a_cur * v->T_d;
      // ---------------------------------------------------

      // начало разгона -------------------------------------
      if ((v->a_cur < v->a_max) && (v_err > v_delt))
      {
        v->v_cur += (jog * v->T_d * v->T_d * 0.5);
        v->a_cur += (jog * v->T_d);
        if (v->a_cur >  v->a_max)
        {
        // достижение максимального ускорения
          v->a_cur = v->a_max;
        }
      } // -------------------------------------------------

      // окончание разгона ---------------------------------
      if (v_err < v_delt)
      {
        v->v_cur -= (jog * v->T_d * v->T_d * 0.5);
        v->a_cur -= (jog * v->T_d);
        if (v->v_cur > *v->V_ref)
        {
          // остановка в целевом положении
          v->v_cur = *v->V_ref;
          v->a_cur = 0;
        }
      } // -------------------------------------------------
      //====================================================
    } else {
    // торможение ===============================================

     // равноускоренное движение --------------------------
      v->v_cur += v->a_cur * v->T_d;
      // ---------------------------------------------------

      // начало торможения -------------------------------------
      if ((v->a_cur > -v->a_max) && (v_err < v_delt))
      {
        v->v_cur -= (jog * v->T_d * v->T_d * 0.5);
        v->a_cur -= (jog * v->T_d);
        if (v->a_cur <  -v->a_max)
        {
        // достижение максимального ускорения
          v->a_cur = -v->a_max;
        }
      } // -------------------------------------------------

      // окончание торможения ---------------------------------
      if (v_err > v_delt)
      {
        v->v_cur += (jog * v->T_d * v->T_d * 0.5);
        v->a_cur += (jog * v->T_d);
        if (v->v_cur < *v->V_ref)
        {
          // остановка в целевом положении
          v->v_cur = *v->V_ref;
          v->a_cur = 0;
        }
      } // -------------------------------------------------
        //====================================================

    }
  } else {
  // сброс значений
    v->a_cur = 0;
    v->v_cur = 0;
  }

}

