/*    Copyright 2017 	АО "НИИЭТ" и ООО "НПФ ВЕКТОР"

   Licensed under the Apache License, Version 2.0 (the "License");
   you may not use this file except in compliance with the License.
   You may obtain a copy of the License at

       http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing, software
   distributed under the License is distributed on an "AS IS" BASIS,
   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
   See the License for the specific language governing permissions and
   limitations under the License.
*/
// V_motorParams_DCM.h
//Файл с массивами параметров модели для различных вариантов ДПТ

	// !!! Внимание! При соотношении параметров ОВ с малой индуктивность и большим сопротивлением расчет ОВ может выполняться некорректно
	// !!! Критическое соотношение параметров Lf=6.3 мГн и Rf=125 Ом
	// !!! Если ДПТ с постоянными магнитами, то параметры индуктивность и сопротивление ОВ должны быть заданы равными нулю.

//структура с параметрами двигателя
struct Sdcm_param
{
	 float r_f; 			//!< сопротивление ОВ
	 float l_f; 			//!< индуктивность ОВ, мГн
	 float l_m; 			//!< коэффициент магнитного потока (взаимная индуктивность)
	 float r_a; 			//!< сопротивления якоря
	 float l_a; 			//!< индуктивность якоря, мГн
	 float RatedFluxCurrent;//!< номинальный ток ОВ
	 float RatedCurrent; 	//!< номинальный ток якоря
	 float j;				//!< момент инерции
	 float qep; 			//!< число меток энкодера
	 float RatedPower;		//!< номинальная мощность (справочная величина, не используется в расчетах)
	 float RatedSpeed;		//!< номинальная скорость (справочная величина, не используется в расчетах)
};
typedef volatile struct Sdcm_param Tdcm_param;

// !!! Внимание! Последний набор параметров в массиве ОБяЗАТЕЛЬНО должен быть нулевым!
Tdcm_param DCMDATA[] = {\
//		|r_f	|l_f			|l_m			|r_a		|l_a			|If		|Current	|j			|qep	|Power	|Speed
		{0, 	0, 				0.075073632,	70.2,		6.68,			0,		0.347,		0.0000012,	3000,	0.011,	3900},\
		{0,		0,				0.070452941,	16.6,		2.22,			0,		0.659,		0.00000438,	3000,	0.02,	4210},\
		{107,	6.197183099,	1.546863917,	0.423,		48.85355617,	1.42,	47,			0.3,		2000,	8.5,	870},\
		{94,	8.25,			1.531438221,	0.266,		40.06358237,	1.6,	65,			0.425,		1000,	12,		790},\
		{70,	7.727272727,	1.25299365,		0.177,		34.78965363,	2.2,	85,			0.8,		2000,	16,		710},\
		{65,	10.20833333,	1.249697876,	0.1155,		29.29350547,	2.4,	110,		1.05,		3000,	21,		660},\
		{58,	11.15384615,	1.019986658,	0.0545,		17.38016729,	2.6,	164,		1.87,		5000,	32,		760},\
		{42,	12.5,			0.900878093,	0.0332,		15.1587913,		3.6,	233,		4,			10000,	46,		625},\
		{36,	13.25581395,	0.802128868,	0.0204,		11.08986109,	4.3,	338,		8.25,		1000,	67,		590},\
		{34.4,	20,				0.890579855,	0.0117,		9.550454994,	4.6,	470,		17,			2000,	95,		500},\
		{24.4,	17.93650794,	0.693407611,	0.00745,	7.155498472,	6.3,	670,		32.5,		3000,	135,	470},\
		{0,		0,				0,				0,			0,				0,		0,			0,			0,		0,		0},\
};
